In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 = {
    "name":['Amit','Amol','Ajit','Ajay'],
    "marks":[91, 90, 78, 89],
    "city":['Jath','Sangola','Sangli','Solapur']
}

In [3]:
df = pd.DataFrame(dict1)

In [4]:
df

   name  marks     city
0  Amit     91     Jath
1  Amol     90  Sangola
2  Ajit     78   Sangli
3  Ajay     89  Solapur

In [6]:
  df.to_csv('borthers.csv')

In [7]:
dict1 = {
    "name":['Prashant','Sushant','Amit','Ajay'],
    "marks":[91, 90, 78, 89],
    "city":['Jath','Sangola','Sangli','Solapur']
}

In [8]:
df

   name  marks     city
0  Amit     91     Jath
1  Amol     90  Sangola
2  Ajit     78   Sangli
3  Ajay     89  Solapur

In [9]:
df = pd.DataFrame(df)

In [10]:
df

   name  marks     city
0  Amit     91     Jath
1  Amol     90  Sangola
2  Ajit     78   Sangli
3  Ajay     89  Solapur

In [11]:
df = pd.DataFrame(dict1)

In [12]:
df

       name  marks     city
0  Prashant     91     Jath
1   Sushant     90  Sangola
2      Amit     78   Sangli
3      Ajay     89  Solapur

In [13]:
pd.to_csv(df)

AttributeError: module 'pandas' has no attribute 'to_csv'

In [15]:
df.to_csv('brothers.csv')

In [17]:
df.to_csv('brothers_index_false.csv', index=False)

In [18]:
df.head(2)

       name  marks     city
0  Prashant     91     Jath
1   Sushant     90  Sangola

In [19]:
df.tail(2)

   name  marks     city
2  Amit     78   Sangli
3  Ajay     89  Solapur

In [20]:
df.describe()

           marks
count   4.000000
mean   87.000000
std     6.055301
min    78.000000
25%    86.250000
50%    89.500000
75%    90.250000
max    91.000000

In [22]:
sawant = pd.read_csv('sawant.csv')

In [24]:
sawant

   Car No  Car Speed   Brand
0    9191         80   Swift
1    9192         90    Audi
2    9193        100     Jag
3    9194        110  Ferari

In [25]:
sawant

   Car No  Car Speed   Brand
0    9191         80   Swift
1    9192         90    Audi
2    9193        100     Jag
3    9194        110  Ferari

In [26]:
sawant['Car Speed']]

SyntaxError: invalid syntax (<ipython-input-26-78b9955d188c>, line 1)

In [27]:
sawant = pd.read_csv('sawant.csv')

In [28]:
sawant

   CarNo  CarSpeed    Brand
0   9191        80    Swift
1   9192        90     Audi
2   9193       100      Jag
3   9194       110  Ferrari

In [29]:
sawant['CarSpeed']

0     80
1     90
2    100
3    110
Name: CarSpeed, dtype: int64

In [30]:
sawant['Brand']

0      Swift
1       Audi
2        Jag
3    Ferrari
Name: Brand, dtype: object

In [31]:
sawant['Brand'][3]

'Ferrari'

In [32]:
sawant['Brand'][2]

'Jag'

In [33]:
sawant['Brand'][2] = 'Tesla'

c:\users\hp\appdata\local\programs\python\python37\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [34]:
sawant

   CarNo  CarSpeed    Brand
0   9191        80    Swift
1   9192        90     Audi
2   9193       100    Tesla
3   9194       110  Ferrari

In [35]:
type(sawant)

pandas.core.frame.DataFrame

In [38]:
sawant.to_csv('sawant.csv')

In [39]:
sawant.index

RangeIndex(start=0, stop=4, step=1)

In [40]:
sawant.index = ['First','Second','Third','Fourth']

In [41]:
sawant

        CarNo  CarSpeed    Brand
First    9191        80    Swift
Second   9192        90     Audi
Third    9193       100    Tesla
Fourth   9194       110  Ferrari